<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>DNSSettings</key>
			<dict>
				<key>DNSProtocol</key>
				<string>HTTPS</string>
				<key>ServerAddresses</key>
				<array>
					<string>1.1.1.2</string>
					<string>1.0.0.2</string>
					<string>2606:4700:4700::1112</string>
					<string>2606:4700:4700::1002</string>
				</array>
				<key>ServerURL</key>
				<string>https://security.cloudflare-dns.com/dns-query</string>
			</dict>
			<key>PayloadDescription</key>
			<string>Configures your device to use Cloudflare DNS over HTTPS with malware blocking.</string>
			<key>PayloadDisplayName</key>
			<string>Cloudflare DNS over HTTPS with malware blocking</string>
			<key>PayloadIdentifier</key>
			<string>com.adamheckler.cloudflare-doh-filter-malware.73A844E4-F911-4E94-9F4A-772CA8486969</string>
			<key>PayloadType</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>PayloadUUID</key>
			<string>3C01D8EF-74CB-4D7D-8AC0-6C0C9B2D3CE2</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>ProhibitDisablement</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Configures your device to use Cloudflare DNS over HTTPS with malware blocking.</string>
	<key>PayloadDisplayName</key>
	<string>Cloudflare DNS over HTTPS with malware blocking</string>
	<key>PayloadIdentifier</key>
	<string>com.adamheckler.cloudflare-doh-filter-malware</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>857EA091-9ECD-4B66-AB2F-DDE5BB53BC5F</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
