<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>DNSSettings</key>
			<dict>
				<key>DNSProtocol</key>
				<string>HTTPS</string>
				<key>ServerAddresses</key>
				<array>
					<string>1.1.1.3</string>
					<string>1.0.0.3</string>
					<string>2606:4700:4700::1113</string>
					<string>2606:4700:4700::1003</string>
				</array>
				<key>ServerURL</key>
				<string>https://family.cloudflare-dns.com/dns-query</string>
			</dict>
			<key>PayloadDescription</key>
			<string>Configures your device to use Cloudflare DNS over HTTPS with malware and adult content blocking.</string>
			<key>PayloadDisplayName</key>
			<string>Cloudflare DNS over HTTPS with malware and adult content blocking</string>
			<key>PayloadIdentifier</key>
			<string>com.adamheckler.cloudflare-doh-filter-malware-adultcontent.F781AABE-76E4-479D-9BB5-F01EFDB64FFE</string>
			<key>PayloadType</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>PayloadUUID</key>
			<string>9AE0F480-5096-4B6D-B91A-90BA1B735C0C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>ProhibitDisablement</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Configures your device to use Cloudflare DNS over HTTPS with malware and adult content blocking.</string>
	<key>PayloadDisplayName</key>
	<string>Cloudflare DNS over HTTPS with malware and adult content blocking</string>
	<key>PayloadIdentifier</key>
	<string>com.adamheckler.cloudflare-doh-filter-malware-adultcontent</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>047F6676-AE34-46BF-8334-995D575AE38A</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
